БухЭксп/InformationRegisters/CW_НастройкиКолонокЖурналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НастройкиКолонокЖурналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НастройкиКолонокЖурналов/Ext/ManagerModule.bsl
Процедура ЗаписатьНастройку(ПараметрыЗаписи, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПараметрыЗаписи.ТипОбъекта, Ложь);
	Если ИдентификаторОбъектаМетаданных = Null Тогда  
		ЗаписьЖурналаРегистрации("ЗаписьНастроек",
		,
		ПараметрыЗаписи.Метаданные,
		,
		"Настройка не сохранена! При причине: отсутствует элемент справочника ""Идентификаторы объектов метаданных"" для типа """+ПараметрыЗаписи.ТипОбъекта);
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.CW_НастройкиКолонокЖурналов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.Прочитать();    
	
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.ХранилищеНастроек = Новый ХранилищеЗначения(Настройка);
	Запись.Записать(Истина);		

КонецПроцедуры
	
Функция ПолучитьНастройку(ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПараметрыЗаписи.ТипОбъекта);
	Если ИдентификаторОбъектаМетаданных = Null Тогда  
		ЗаписьЖурналаРегистрации("ЗаписьНастроек",
		,
		ПараметрыЗаписи.Метаданные,
		,
		"Настройка не сохранена! При причине: отсутствует элемент справочника ""Идентификаторы объектов метаданных"" для типа """+ПараметрыЗаписи.ТипОбъекта);
		Возврат Неопределено;
	КонецЕсли;
	
	Запись = РегистрыСведений.CW_НастройкиКолонокЖурналов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.Прочитать();    
	
	Если Запись.Выбран() Тогда
		Возврат Запись.ХранилищеНастроек.Получить();	
	КонецЕсли;
	
КонецФункции
